export type KarutaCard = {
    letter: string;
    text: string;
    kana: string;
    author: "代表" | "事務総長";
};

export const karutaList: KarutaCard[] = [
    //あ行
    { letter: "あ", text: "あなた男性よね。私の見間違いならごめんなさい。", kana: "あなただんせいよね。わたしのみまちがいならごめんなさい。", author: "事務総長" },
    { letter: "い", text: "いつか宝塚の隠れ家に招待したい。", kana: "いつか宝塚のかくれがに招待したい。", author: "代表" },
    { letter: "う", text: "失せな", kana: "失せな", author: "事務総長" },
    { letter: "え", text: "SFやで。SFやで。SFやで。", kana: "SFやで。SFやで。SFやで。", author: "代表" },
    // か行
    { letter: "か", text: "海乱鬼さんは信用できる人です！", kana: "かいらぎさんは、しんようできるひとです！", author: "代表" },
    { letter: "き", text: "今日はこの話ですか？", kana: "今日はこの話ですか？", author: "事務総長" },
    { letter: "く", text: "クマさんありがとう❤️", kana: "クマさんありがとう！", author: "事務総長" },
    { letter: "こ", text: "恋すると、なんでもない距離やけど", kana: "こいすると、なんでもないきょりやけど", author: "代表" },
    // さ行
    { letter: "さ", text: "晒していくよ。", kana: "さらしていくよ", author: "事務総長" },
    { letter: "し", text: "知らんがな", kana: "しらんがな", author: "代表" },
    { letter: "す", text: "スーパーチャット 100円でも500円でもいいからお願いします えへへ", kana: "スーパーチャット、100円でも500円でもいいからお願いします。えへへ。", author: "代表" },
    { letter: "せ", text: "せんずりが正しい！へんずりは大阪弁", kana: "せんずりが正しい！へんずりは大阪弁", author: "代表" },
    { letter: "そ", text: "それでは閉めます、この後は有料チャンネルで。", kana: "それでは閉めます、この後は有料チャンネルで。", author: "事務総長" },
    // た行
    { letter: "た", text: "ただし証拠は一切ない", kana: "ただし、証拠は一切ない", author: "代表" },
    { letter: "つ", text: "月に500円くらいでワシを自由に使おうとするなよ", kana: "月に500円くらいで、ワシを自由に使おうとするなよ", author: "代表" },
    { letter: "と", text: "という悪口、ご苦労さま。笑", kana: "という悪口、ご苦労さま。わら", author: "事務総長" },
    // な行
    { letter: "な", text: "70歳になったら性自認の変更を考えている", kana: "７０歳になったら、性自認の変更を考えている", author: "代表" },
    { letter: "に", text: "日本初の女性総理、飯山陽です！", kana: "日本初の女性総理、飯山あかりです！", author: "代表" },
    { letter: "ね", text: "年間のへんずり回数が250回を切ったら、小説書くのをやめます！", kana: "年間のへんずり回数が、250回を切ったら、小説書くのをやめます！", author: "代表" },
    // は行
    { letter: "は", text: "橋下のボケも来るかもしれない。口論になれば殴ってしまうかも...。", kana: "はしもとのボケも来るかもしれない。口論になれば、殴ってしまうかも。", author: "代表" },
    { letter: "ひ", text: "久しぶりに生田さんと呑みたい気分です、あたし。", kana: "久しぶりに生田さんと呑みたい気分です、あたし。", author: "事務総長" },
    { letter: "ふ", text: "武士の情け", kana: "武士の情け", author: "事務総長" },
    { letter: "ほ", text: "ホンダっていう会社が昔バイク作ってたでしょ", kana: "ホンダっていう会社が昔バイク作ってたでしょ", author: "事務総長" },
    { letter: "ほ", text: "ほ、ほんまか？", kana: "ほ、ほんまか？", author: "代表" },
    // ま行
    { letter: "ま", text: "マジで自宅か会社に乗り込む。", kana: "マジで自宅か会社に乗り込む。", author: "代表" },
    { letter: "み", text: "港区女子を上納してください", kana: "港区女子を上納してください", author: "代表" },
    { letter: "も", text: "もっと褒めて〜", kana: "もっと褒めて〜", author: "代表" },
    // や行
    { letter: "や", text: "ヤクザとか元ヤクザの知り合いおるんです", kana: "ヤクザとか、元ヤクザの知り合い、おるんです", author: "代表" },
    { letter: "よ", text: "世の中には悪質なYouTuberがいます", kana: "世の中には、悪質なYouTuberがいます", author: "代表" },
    // ら行
    { letter: "ら", text: "来週を持ってXでのポストをやめます", kana: "来週を持ってエックスでのポストをやめます", author: "代表" },
    // わ行
    { letter: "わ", text: "若い女の子と混浴したいなぁ 誰か一緒に入ってくれる子おらんかなぁ", kana: "若い女の子と混浴したいなー。誰か一緒に入ってくれる子おらんかなー", author: "代表" },
    { letter: "を", text: "「を」は要りません。さちこさん、#コオロギ食べない連合です。", kana: "「を」は要りません。さちこさん、コオロギ食べない連合です。", author: "事務総長" },
];
